src/test/java/DataFiles/ProviderProfile_Licenses.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:lnrisk:ws:wshealthcare:(internal)@ver=${#Project#ver}2.7">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:ProviderReportRequest>
            <!--You may enter the following 6 items in any order-->
            <!--Optional:-->
            <urn:User>
                <!--You may enter the following 44 items in any order-->
                <!--Optional:-->
                <urn:ReferenceCode/>
                <!--Optional:-->
                <urn:BillingCode/>
                <!--Optional:-->
                <urn:QueryId/>
                <!--Optional:-->
                <urn:CompanyId/>
                <!--Optional:-->
                <urn:BillingId/>
                <!--Optional:-->
                <urn:GLBPurpose/>
                <!--Optional:-->
                <urn:DLPurpose/>
                <!--Optional:-->
                <urn:LoginHistoryId/>
                <!--Optional:-->
                <urn:DebitUnits/>
                <!--Optional:-->
                <urn:IP/>
                <!--Optional:-->
                <urn:IndustryClass/>
                <!--Optional:-->
                <urn:ResultFormat/>
                <!--Optional:-->
                <urn:LogAsFunction/>
                <!--Optional:-->
                <urn:LogAsSuplFunction/>
                <!--Optional:-->
                <urn:SSNMask/>
                <!--Optional:-->
                <urn:DOBMask/>
                <!--Optional:-->
                <urn:ExcludeDMVPII>true</urn:ExcludeDMVPII>
                <!--Optional:-->
                <urn:DLMask/>
                <!--Optional:-->
                <urn:DataRestrictionMask>${DRM_NO_RESTRICT_ALL}</urn:DataRestrictionMask>
                <!--Optional:-->
                <urn:DataPermissionMask>${DPM_ALL}</urn:DataPermissionMask>
                <!--Optional:-->
                <urn:DeathMasterPurpose/>
                <!--Optional:-->
                <urn:SourceCode/>
                <!--Optional:-->
                <urn:ApplicationType/>
                <!--Optional:-->
                <urn:SSNMaskingOn/>
                <!--Optional:-->
                <urn:DLMaskingOn/>
                <!--Optional:-->
                <urn:LnBranded>false</urn:LnBranded>
                <!--Optional:-->
                <urn:EndUser>
                    <!--You may enter the following 6 items in any order-->
                    <!--Optional:-->
                    <urn:CompanyName/>
                    <!--Optional:-->
                    <urn:StreetAddress1/>
                    <!--Optional:-->
                    <urn:City/>
                    <!--Optional:-->
                    <urn:State/>
                    <!--Optional:-->
                    <urn:Zip5/>
                    <!--Optional:-->
                    <urn:Phone/>
                </urn:EndUser>
                <!--Optional:-->
                <urn:MaxWaitSeconds/>
                <!--Optional:-->
                <urn:RelatedTransactionId/>
                <!--Optional:-->
                <urn:AccountNumber/>
                <!--Optional:-->
                <urn:OutcomeTrackingOptOut/>
                <!--Optional:-->
                <urn:NonSubjectSuppression/>
                <!--Optional:-->
                <urn:ProductType/>
                <!--Optional:-->
                <urn:BatchJobId/>
                <!--Optional:-->
                <urn:BatchSequenceNumber/>
                <!--Optional:-->
                <urn:ArchiveOptIn/>
                <!--Optional:-->
                <urn:ProcessSpecId/>
                <!--Optional:-->
                <urn:ProductCode/>
                <!--Optional:-->
                <urn:AllowRoamingBypass/>
                <!--Optional:-->
                <urn:ConsumerStatementsMask/>
                <!--Optional:-->
                <urn:OutputType/>
                <!--Optional:-->
                <urn:DataSource/>
                <!--Optional:-->
                <urn:ResellerType/>
                <!--Optional:-->
                <urn:GCID/>
            </urn:User>
            <!--Optional:-->
            <urn:RemoteLocations>
                <!--Zero or more repetitions:-->
                <urn:Item/>
            </urn:RemoteLocations>
            <!--Optional:-->
            <urn:ServiceLocations>
                <!--Zero or more repetitions:-->
                <urn:ServiceLocation>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <urn:LocationId/>
                    <!--Optional:-->
                    <urn:ServiceName/>
                    <!--Optional:-->
                    <urn:Parameters>
                        <!--Zero or more repetitions:-->
                        <urn:Parameter>
                            <!--You may enter the following 2 items in any order-->
                            <!--Optional:-->
                            <urn:Name/>
                            <!--Optional:-->
                            <urn:Value/>
                        </urn:Parameter>
                    </urn:Parameters>
                </urn:ServiceLocation>
            </urn:ServiceLocations>
            <!--Optional:-->
            <urn:HealthcareConfig>
                <!--You may enter the following 2 items in any order-->
                <!--Optional:-->
                <urn:Type/>
                <!--Optional:-->
                <urn:ProductKey/>
            </urn:HealthcareConfig>
            <!--Optional:-->
            <urn:Options>
                <!--You may enter the following 57 items in any order-->
                <!--Optional:-->
                <urn:Blind/>
                <!--Optional:-->
                <urn:Encrypt/>
                <!--Optional:-->
                <urn:IntendedUse/>
                <!--Optional:-->
                <urn:UserAgent/>
                <!--Optional:-->
                <urn:ThresholdLimit/>
                <!--Optional:-->
                <urn:MaxResultCount/>
                <!--Optional:-->
                <urn:ReturnCount>25</urn:ReturnCount>
                <!--Optional:-->
                <urn:StartingRecord>1</urn:StartingRecord>
                <!--Optional:-->
                <urn:IncludeAllSets/>
                <!--Optional:-->
                <urn:IncludeEmail/>
                <!--Optional:-->
                <urn:IncludeLanguages/>
                <!--Optional:-->
                <urn:IncludeLexIDs/>
                <!--Optional:-->
                <urn:IncludeCoveredRecipients>true</urn:IncludeCoveredRecipients>
                <!--Optional:-->
                <urn:IncludeShaID/>
                <!--Optional:-->
                <urn:IncludeSurescripts/>
                <!--Optional:-->
                <urn:IncludeTaxID/>
                <!--Optional:-->
                <urn:IncludeMedicalEducationNumber/>
                <!--Optional:-->
                <urn:IncludeIncomplete/>
                <!--Optional:-->
                <urn:IncludeNonEnumerated/>
                <!--Optional:-->
                <urn:IncludeSanctions/>
                <!--Optional:-->
                <urn:IncludeSpecialties/>
                <!--Optional:-->
                <urn:IncludeLicenses>true</urn:IncludeLicenses>
                <!--Optional:-->
                <urn:IncludeDOB/>
                <!--Optional:-->
                <urn:IncludeDOD/>
                <!--Optional:-->
                <urn:IncludeFEIN/>
                <!--Optional:-->
                <urn:IncludeDEA/>
                <!--Optional:-->
                <urn:IncludeNPI/>
                <!--Optional:-->
                <urn:IncludeUPIN/>
                <!--Optional:-->
                <urn:IncludeTaxonomy/>
                <!--Optional:-->
                <urn:IncludeMedSchool/>
                <!--Optional:-->
                <urn:IncludeMedicareId/>
                <!--Optional:-->
                <urn:IncludeMedicaid/>
                <!--Optional:-->
                <urn:IncludeCSR/>
                <!--Optional:-->
                <urn:IncludeEssentialCommunityResources/>
                <!--Optional:-->
                <urn:IncludeAffiliations/>
                <!--Optional:-->
                <urn:IncludeABMSBoardCertifiedSpecialty/>
                <!--Optional:-->
                <urn:IncludeVerifiedSecureFax/>
                <!--Optional:-->
                <urn:IncludeConsumerOptOutData/>
                <!--Optional:-->
                <urn:SuppressLicenseHistory>true</urn:SuppressLicenseHistory>
                <!--Optional:-->
                <urn:SortAndRankLicenseTogether/>
                <!--Optional:-->
                <urn:MixedCaseOutput/>
                <!--Optional:-->
                <urn:MatchScoreThreshold/>
                <!--Optional:-->
                <urn:DEAGraceDays/>
                <!--Optional:-->
                <urn:NPIGraceDays/>
                <!--Optional:-->
                <urn:LicenseGraceDays/>
                <!--Optional:-->
                <urn:LicenseVerificationThreshold/>
                <!--Optional:-->
                <urn:UsePracticeStateForEmptyLicenseState/>
                <!--Optional:-->
                <urn:Product/>
                <!--Optional:-->
                <urn:OneStepRule/>
                <!--Optional:-->
                <urn:BestRules/>
                <!--Optional:-->
                <urn:ExcludeGSASanction/>
                <!--Optional:-->
                <urn:IncludeMedicareEnrollment/>
                <!--Optional:-->
                <urn:IncludeMedicareOrderReferring/>
                <!--Optional:-->
                <urn:ExcludeEmail1/>
                <!--Optional:-->
                <urn:ExcludeEmail2/>
                <!--Optional:-->
                <urn:ExcludeEmail3/>
                <!--Optional:-->
                <urn:ExcludeNetworkTags/>
            </urn:Options>
            <!--Optional:-->
            <urn:ReportBy>
                <!--You may enter the following 34 items in any order-->
                <!--Optional:-->
                <urn:LNPID/>
                <!--Optional:-->
                <urn:UniqueId/>
                <!--Optional:-->
                <urn:ProviderName>
                    <!--You may enter the following 7 items in any order-->
                    <!--Optional:-->
                    <urn:Full/>
                    <!--Optional:-->
                    <urn:First/>
                    <!--Optional:-->
                    <urn:Middle/>
                    <!--Optional:-->
                    <urn:Last/>
                    <!--Optional:-->
                    <urn:Suffix/>
                    <!--Optional:-->
                    <urn:Prefix/>
                    <!--Optional:-->
                    <urn:ProfessionalSuffix/>
                </urn:ProviderName>
                <!--Optional:-->
                <urn:ProviderStatus/>
                <!--Optional:-->
                <urn:LocationCompanyName/>
                <!--Optional:-->
                <urn:LocationHospitalName/>
                <!--Optional:-->
                <urn:LocationAddress>
                    <!--You may enter the following 22 items in any order-->
                    <!--Optional:-->
                    <urn:AddressType/>
                    <!--Optional:-->
                    <urn:StreetNumber/>
                    <!--Optional:-->
                    <urn:StreetPreDirection/>
                    <!--Optional:-->
                    <urn:StreetName/>
                    <!--Optional:-->
                    <urn:StreetSuffix/>
                    <!--Optional:-->
                    <urn:StreetPostDirection/>
                    <!--Optional:-->
                    <urn:UnitDesignation/>
                    <!--Optional:-->
                    <urn:UnitNumber/>
                    <!--Optional:-->
                    <urn:StreetAddress1/>
                    <!--Optional:-->
                    <urn:StreetAddress2/>
                    <!--Optional:-->
                    <urn:City/>
                    <!--Optional:-->
                    <urn:State/>
                    <!--Optional:-->
                    <urn:Zip5/>
                    <!--Optional:-->
                    <urn:Zip4/>
                    <!--Optional:-->
                    <urn:County/>
                    <!--Optional:-->
                    <urn:PostalCode/>
                    <!--Optional:-->
                    <urn:StateCityZip/>
                    <!--Optional:-->
                    <urn:Latitude/>
                    <!--Optional:-->
                    <urn:Longitude/>
                    <!--Optional:-->
                    <urn:CBSA/>
                    <!--Optional:-->
                    <urn:LegacyLocationId/>
                    <!--Optional:-->
                    <urn:LegacyAggregateId/>
                </urn:LocationAddress>
                <!--Optional:-->
                <urn:DistanceFromLocationAddress/>
                <!--Optional:-->
                <urn:DOB>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <urn:Year/>
                    <!--Optional:-->
                    <urn:Month/>
                    <!--Optional:-->
                    <urn:Day/>
                </urn:DOB>
                <!--Optional:-->
                <urn:Gender/>
                <!--Optional:-->
                <urn:TIN/>
                <!--Optional:-->
                <urn:UPIN/>
                <!--Optional:-->
                <urn:Phone/>
                <!--Optional:-->
                <urn:Fax/>
                <!--Optional:-->
                <urn:Licenses>
                    <!--Zero or more repetitions:-->
                    <urn:License>
                        <!--You may enter the following 3 items in any order-->
                        <!--Optional:-->
                        <urn:Type>MDR</urn:Type>
                        <!--Optional:-->
                        <urn:Number>101250475</urn:Number>
                        <!--Optional:-->
                        <urn:State>VA</urn:State>
                    </urn:License>
                </urn:Licenses>
                <!--Optional:-->
                <urn:NPINumber/>
                <!--Optional:-->
                <urn:DEANumbers>
                    <!--Zero or more repetitions:-->
                    <urn:DEANumber/>
                </urn:DEANumbers>
                <!--Optional:-->
                <urn:Taxonomies>
                    <!--Zero or more repetitions:-->
                    <urn:Taxonomy/>
                </urn:Taxonomies>
                <!--Optional:-->
                <urn:Specialties>
                    <!--Zero or more repetitions:-->
                    <urn:Specialty>
                        <!--You may enter the following 3 items in any order-->
                        <!--Optional:-->
                        <urn:PractitionerType/>
                        <!--Optional:-->
                        <urn:Specialty/>
                        <!--Optional:-->
                        <urn:SubSpecialty/>
                    </urn:Specialty>
                </urn:Specialties>
                <!--Optional:-->
                <urn:MedicareNumber/>
                <!--Optional:-->
                <urn:MedicareState/>
                <!--Optional:-->
                <urn:MedicaidNumber/>
                <!--Optional:-->
                <urn:MedicaidState/>
                <!--Optional:-->
                <urn:CSRNumber/>
                <!--Optional:-->
                <urn:CSRState/>
                <!--Optional:-->
                <urn:Email/>
                <!--Optional:-->
                <urn:MedSchool>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <urn:SchoolName/>
                    <!--Optional:-->
                    <urn:GraduationYear/>
                    <!--Optional:-->
                    <urn:Code/>
                </urn:MedSchool>
                <!--Optional:-->
                <urn:ServiceFrom>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <urn:Year/>
                    <!--Optional:-->
                    <urn:Month/>
                    <!--Optional:-->
                    <urn:Day/>
                </urn:ServiceFrom>
                <!--Optional:-->
                <urn:ServiceTo>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <urn:Year/>
                    <!--Optional:-->
                    <urn:Month/>
                    <!--Optional:-->
                    <urn:Day/>
                </urn:ServiceTo>
                <!--Optional:-->
                <urn:SurescriptsProviderId/>
                <!--Optional:-->
                <urn:SHAId/>
                <!--Optional:-->
                <urn:MedicalEducationNumber/>
                <!--Optional:-->
                <urn:CoveredRecipientId/>
                <!--Optional:-->
                <urn:LegacyIds>
                    <!--Zero or more repetitions:-->
                    <urn:LegacyId>
                        <!--You may enter the following 2 items in any order-->
                        <!--Optional:-->
                        <urn:Id/>
                        <!--Optional:-->
                        <urn:Source/>
                    </urn:LegacyId>
                </urn:LegacyIds>
            </urn:ReportBy>
        </urn:ProviderReportRequest>
    </soapenv:Body>
</soapenv:Envelope>